<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AnalysisSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('mkhtbr_analyses')->truncate();
        DB::table('analysis_items')->truncate();
        DB::statement("
            INSERT INTO `mkhtbr_analyses` (`id`, `patient_id`, `animal_id`, `date`, `babeosis`, `recmondations`, `created_at`, `updated_at`, `hash_code`, `package_id`, `strain_id`) VALUES
            (1, 4, 1, '2024-06-23', NULL, 'العناية بالحيوان جيدا', '2024-06-23 13:13:26', '2024-06-23 13:13:26', 'T0pkKF9oGuufuh4OSJJ0HTyeMMjVljN4lkPG3cjECyhsS9hmsu', 13, 2);
        ");

        DB::statement("
            INSERT INTO `analysis_items` (`id`, `mkhtbr_analysis_id`, `department_id`, `result`, `range`, `unit`, `name_ar`, `name_en`, `created_at`, `updated_at`, `reference_range`) VALUES
            (1, 1, 119, '2', '0.5 - 2.5', NULL, 'الكرياتينين', 'creatinine', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (2, 1, 120, '21', '3.2 - 26', NULL, 'اليوريا', 'Urea', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (3, 1, 121, '10', '5.2 - 8', NULL, 'البروتين الكلي', 'Total Proteian', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (4, 1, 122, '100', '313 - 933', NULL, 'انزيم العضلات 1', ' 1 - LDH', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (5, 1, 123, '20', '3 - 25', 'U/L	', 'انزيم 1', ' - ALT(SGPT)	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (6, 1, 124, '112', '8 - 120', 'U/L	', 'انزيم العضلات 2	', ' - CK', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (7, 1, 125, '30', '30 - 135', 'U/L	', 'انزيم 2', ' AST', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (8, 1, 126, '20', '5 - 55', 'U/L	', 'انزيم 3', 'GGT', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (9, 1, 127, '200', '41 - 295', 'U/L	', 'انزيم 4 ', ' ALP	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (10, 1, 128, '12', '7 - 12.7', 'X10 `12L	', 'عدد الكريات الحمراء 	', ' RBC', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (11, 1, 129, '15', '8 - 16', NULL, 'المناعة ', 'WBCs	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (12, 1, 130, '13', '9.9 - 13.6', 'g/dl	', 'الهيموجلوبين 	', ' HGB', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (13, 1, 131, '4', '4.43 - 8.09', '%', 'الخلايا المتعادلة  ', 'NEU	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (14, 1, 132, '19', '21 - 26.5', '%', 'حجم الكرية الحمراء', 'HCT 	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (15, 1, 133, '22', '1.7 - 6.4', '%	', 'الخلايا اللمفاوية ', ' LYMPH	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (16, 1, 134, '25', '43 - 51', 'g/dl	', 'تركيز الهيموجلوبين  	', 'MCHC', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (17, 1, 135, '0.5', '0.4 - 1.04', '%', 'خلايا أحادية النواة ', 'MONO	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (18, 1, 136, '10', '10.7 - 14.5', 'pg', 'متوسط كتلة الهيموجلوبين  ', 'MCH	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (19, 1, 137, '0.8', '0.04 - 0.74', '%', 'خلايا الحساسية  ', 'ESO	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (20, 1, 138, '30', '21 - 31', 'fl	', 'حجم الكرية الحمراء  ', 'MCV	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (21, 1, 139, '0.21', '0.001 - 0.13', '%', 'الخلايا القاعدية  ', 'BAS	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (22, 1, 140, '300', '285 - 436', 'X10`9L', 'الصفائح الدموية  ', 'PLT	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (23, 1, 142, '90', '70 - 160', NULL, 'الحديد ', 'Fe	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (24, 1, 143, '9', '8 - 13.1', NULL, 'الكالسيوم  ', 'Ca	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (25, 1, 144, '5', '4 - 7', NULL, 'الفوسفور   ', 'Ph	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (26, 1, 145, '2', '1.8 - 2.9', NULL, 'الماغنسيوم ', 'Mg	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (27, 1, 146, '200', '70 - 130', NULL, 'السكر  ', 'glucose	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (28, 1, 148, '-ve	', '-ve', NULL, 'أنابلازما ', 'Anaplasma	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (29, 1, 149, '-ve	', '-ve', NULL, 'بابيزيا  ', 'Babesia	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (30, 1, 150, '-ve	', '-ve', NULL, 'ثيليريا  ', 'Theileria	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL),
            (31, 1, 151, '+ve', '-ve', NULL, 'تريبانوسوما  ', 'Trypanosoma	', '2024-06-23 13:13:26', '2024-06-23 13:13:26', NULL);
        ");
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');

    }
}
